In [1]:
import pandas as pd
from sqlalchemy import create_engine
import datapackage

### Store CSV into DataFrame

In [2]:
data = "csiro_recons_gmsl_yr_2015_csv.csv"
rate_df = pd.read_csv(data)
rate_df.head()

         Time   GMSL  GMSL uncertainty
0  1880-03-15 -158.7              24.2
1  1881-03-15 -153.1              24.2
2  1882-03-15 -169.9              23.0
3  1883-03-15 -164.6              22.8
4  1884-03-15 -143.7              22.2

In [3]:
data2 = "epa-sea-level_csv.csv"
rate2_df = pd.read_csv(data2)
rate2_df.head()

,Year,CSIRO Adjusted Sea Level,Lower Error Bound,Upper Error Bound,NOAA Adjusted Sea Level
0,1880-03-15,0.000000,-0.952756,0.952756,NaN
1,1881-03-15,0.220472,-0.732283,1.173228,NaN
2,1882-03-15,-0.440945,-1.346457,0.464567,NaN
3,1883-03-15,-0.232283,-1.129921,0.665354,NaN
4,1884-03-15,0.590551,-0.283465,1.464567,NaN

In [5]:
data = pd.read_csv('graph.txt', header = None)
new_data = data.drop([0, 1,2,3])
new_data.head()

                          0
4  1880     -0.19     -0.12
5  1881     -0.11     -0.15
6  1882     -0.12     -0.19
7  1883     -0.20     -0.22
8  1884     -0.30     -0.25

In [10]:
rds_connection_string = "root:3SARAnora@127.0.0.1/sea_level_change"
engine = create_engine(f'mysql+pymysql://{rds_connection_string}')

In [12]:
rate_df.to_sql(name='csiro_recons_gmsl_yr_2015', con=engine, if_exists='append', index=False)

In [13]:
rate2_df.to_sql(name='epa-sea-level', con=engine, if_exists='append', index=False)

In [14]:
engine.table_names()

['csiro_recons_gmsl_yr_2015', 'epa-sea-level']

In [17]:
pd.read_sql_query('select * from csiro_recons_gmsl_yr_2015', con=engine).head()

         Time   GMSL  GMSL uncertainty
0  1880-03-15 -158.7              24.2
1  1881-03-15 -153.1              24.2
2  1882-03-15 -169.9              23.0
3  1883-03-15 -164.6              22.8
4  1884-03-15 -143.7              22.2

In [19]:
pd.read_sql_query('select * from epa_sea_level', con=engine).head()

,Year,CSIRO Adjusted Sea Level,Lower Error Bound,Upper Error Bound,NOAA Adjusted Sea Level
0,1880-03-15,0.000000,-0.952756,0.952756,NaN
1,1881-03-15,0.220472,-0.732283,1.173228,NaN
2,1882-03-15,-0.440945,-1.346457,0.464567,NaN
3,1883-03-15,-0.232283,-1.129921,0.665354,NaN
4,1884-03-15,0.590551,-0.283465,1.464567,NaN